#pragma once

//----------------Математическкие константы---------------//
#define PI 3.1415926535897932384626433832795029

//----------------------Монте-Карло-----------------------//
#define M 30000   // число итераций для Монте-Карло


//-------------------Рассчетная область-------------------//
#define x1 0.
#define x2 10.
#define L (x2-x1)

#define t1 0.
#define t2 10.

//------------------------Сетка---------------------------//
#define h 0.02 // шаг по координате
#define t 0.01 // шаг по времени
#define r (t/h)

#define N ((x2 - x1) / h)
#define T ((t2 - t1) / t)

#define SIZE_X (int)(N)
#define SIZE_T (int)(T)


//-----------Коэффициенты уравнения Клейна-Гордона--------//
#define m 2.  // 2
#define g 10. // 1, 10
#define g_0 10.

//--------------------Коэффициенты другие-----------------//
#define TMP 10.  // температура (нужно, чтобы T > m)


//---------------------Коэффициенты КВЕНЧ-----------------//
#define al 1.      // 10
#define x_q 5.    // точка возмущения
#define sigma ((10.*h)/(2*sqrt(2*log(2)))) //  = 0.085



